In [95]:
import numpy as np
import pandas as pd

In [41]:
data= pd.DataFrame(np.arange(9).reshape(3,3), index= list("ABC"), columns= list("xyz"))
data

   x  y  z
A  0  1  2
B  3  4  5
C  6  7  8

In [26]:
#creating a copy of dataframe
data1= data.copy()
data1

   x  y  z
A  0  1  2
B  3  4  5
C  6  7  8

In [27]:
#return raw with particular column
data.query("z==6")
#data.query("x==z")

Empty DataFrame
Columns: [x, y, z]
Index: []

In [28]:
#adding corresponding values of 2 dataframes
data.add(data1, fill_value=0)
#we cannont use fill value in lt, gt, eq in dataframe

    x   y   z
A   0   2   4
B   6   8  10
C  12  14  16

In [29]:
#adding scalar values to dataframe
data.add([2, 5, 7], axis=0)

    x   y   z
A   2   3   4
B   8   9  10
C  13  14  15

In [34]:
data.all(axis=1) #return false if 1 element is 0
data.any(axis=0) #return false if all elements are 0

x    True
y    True
z    True
dtype: bool

In [42]:
#changing value in dataframe
data.at['A', "x"]= np.NaN
data

     x  y  z
A  NaN  1  2
B  3.0  4  5
C  6.0  7  8

In [59]:
#some maths functions
print(data.mean())
print(data.median(axis=1))
print(data.prod())
print(data.sum(axis=1))
print(data.round(decimals=1))
print(data.rename(lambda x: x*2, axis=1))
print(data.sample(n=2, axis=0)) #random values to fix values use random_state=1
print(data.head(2))
print(data.tail(2))

x    4.5
y    4.0
z    5.0
dtype: float64
A    1.5
B    4.0
C    7.0
dtype: float64
x    18.0
y    28.0
z    80.0
dtype: float64
A     3.0
B    12.0
C    21.0
dtype: float64
     x  y  z
A  NaN  1  2
B  3.0  4  5
C  6.0  7  8
    xx  yy  zz
A  NaN   1   2
B  3.0   4   5
C  6.0   7   8
     x  y  z
A  NaN  1  2
B  3.0  4  5
     x  y  z
A  NaN  1  2
B  3.0  4  5
     x  y  z
B  3.0  4  5
C  6.0  7  8

In [66]:
#sorting
data.sort_values(by='y', ascending=False) #sorting dataframe by column y
data.sort_index(ascending= False) #sorting dataframe by index

     x  y  z
C  6.0  7  8
B  3.0  4  5
A  NaN  1  2

In [71]:
#give multidimensional series
df=data.stack()
print(df)
df.unstack()

A  y    1.0
   z    2.0
B  x    3.0
   y    4.0
   z    5.0
C  x    6.0
   y    7.0
   z    8.0
dtype: float64

     x    y    z
A  NaN  1.0  2.0
B  3.0  4.0  5.0
C  6.0  7.0  8.0

In [90]:
#squeeze
data[['x']].squeeze('columns')

A    NaN
B    3.0
C    6.0
Name: x, dtype: float64

In [104]:
#assign
ls=  ["portland","berkley"]
temp= pd.DataFrame([[17.0],[ 25.0]], index= ls, columns= ["temp_c"])
temp
#make a new dataframe with feirenhit
temp1= temp.assign(temp_f= lambda x: x.temp_c*9/5+32)
temp1

          temp_c  temp_f
portland    17.0    62.6
berkley     25.0    77.0